Revit 2024 API
BuiltInFailures.SiteFailures.NoHostForSubregionWarn Property
 This Subregion now does not appear to overlap any Toposurface with an appropriate Phase and Design Option.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NoHostForSubregionWarn { get; }
Visual Basic
Public Shared ReadOnly Property NoHostForSubregionWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NoHostForSubregionWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace